Revit 2024 API
RegenerationAttribute.Option Property
Regeneration option.
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public RegenerationOption Option { get; }
Visual Basic
Public ReadOnly Property Option As RegenerationOption
	Get
Visual C++
public:
property RegenerationOption Option {
	RegenerationOption get ();
}
See Also
RegenerationAttribute Class
Autodesk.Revit.Attributes Namespace